import phonsOne from "@/assets/images/Image (12).png";
import phonsTwo from "@/assets/images/Image (13).png";
import phonsThree from "@/assets/images/Image (14).png";
import phonsFour from "@/assets/images/Image (15).png";
export default function ProductTabOne() {
  return (
    <div>
        <div>
                <p className="text-content-base text-body-small">لقد تم تصميم هاتف ابل ايفون الذكي بهيكل ملفت وجميل يجعلك 
                    تحب النظر إليه في كل الأوقات. تعمل شاشة ليكويد رتينا 6.1 انش على جذب انتباهك وكل حواسك على عكس أي هاتف ذكي آخر. إن تصميم الزجاج والألومنيوم يجعلها متينًة وتضفي على الهاتف مظهرًا مثيرًا للحواس.</p>
                <div className="flex max-md:flex-wrap gap-3 pt-md">
                    <img className="w-full md:w-1/2" src={phonsOne} alt="iphone"/>
                    <img className="w-full md:w-1/2" src={phonsTwo} alt="iphone"/>
                </div>
            </div>
            <div>
                <h6 className="font-bold text-2xl my-lg">للحظات لا تنسى</h6>
                <p className="text-content-base py-md text-body-small">يتميز هاتف ابل الذكي بإعداد كاميرا مزدوجة تبلغ دقتها 12 ميجابكسل تتيح لك 
                    التقاط أجمل الصور بتفاصيل خلابة ورائعة. سواء كانت مناظر طبيعية أو لحظات ثمينة لا تريد نسيانها أو كائنات سريعة الحركة؛ يمكنك التقاط صور لكل ذلك في أفضل الحالات باستخدام إعدادات الكاميرا المتطورة. قم بتصوير مقاطع 
                    الفيديو مثل المحترفين وإنشاء نقطة مرجعية لاسترجاع اللحظات المهمة. لن تؤثر ظروف الإضاءة المنخفضة على 
                    جودة صورتك، حيث توفر الكاميرا العريضة بدقة 12 ميجابكسل تركيزًا تلقائيًا أسرع بثلاث مرات في الإضاءة المنخفضة. مع الوضع الليلي، ليست هناك حاجة للفلاش بعد الآن، حيث يلتقط هذا الإعداد الصور بلون طبيعي وسطوع لا مثيل له. أعط الشيء الذي تريد تصويره الأضواء والتركيز
                     الذي يستحقه مع وضع الصور الشخصية. تستفيد خاصية اتش دي ار الذكية من التعلم الآلي للتعرف على الأشخاص ومعاملتهم بطريقة مختلفة عن بقية اللقطة
                     ، مما توفر ميزات رائعة وظلال ولون بشرة طبيعية. التقط صور سيلفي رائعة مع كاميرا ترو ديبث بدقة تبلغ 12 ميجابكسل. مع خاصية مثبت الصور البصري، لن يكون التقاط صور واضحة مشكلة بعد الآن.
                    </p>
                <img src={phonsThree} alt="iphone" className="w-full mt-md"/>
                <div className="flex max-md:flex-wrap w-full gap-3 pt-md">
                    <img src={phonsFour} className="w-full md:w-1/3 max-h-[300px]"/>
                    <div className="w-full md:w-2/3">
                       <h6 className="font-bold text-2xl text-content-dark ">أداء سلس</h6>
                       <p className="py-md text-content-base text-body-small">يتميز هذا الهاتف الذكي من ابل بشاشة ليكويد رتينا يبلغ حجمها 6.1 انش تعمل 
                        بتقنية اتش دي وتوفر صورًا واضحة ومفصلة لتوصيل متعة الترفيه إلى المستوى الجديد بالكامل. شاهد أفلامك المفضلة أو الأحداث الرياضية المثيرة أو تصفح محتويات مختلفة على الإنترنت واستمتع بها على أكمل وجه بفضل الدمج الاستثنائي بين تقنية ترو تون ودولبي اتموس. يوفر هاتف ابل ايفون 11 صوراً بأعلى جودة ويجعلها تنبض بالحياة بفضل الدقة التي تبلغ
                         1792 × 828 بكسل. تضمن الطبقة المضادة للزيوت ومقاومة لبصمات الأصابع عدم وجود علامات غير مرغوب فيها على الشاشة، حتى بعد الاستخدام المكثف. بالإضافة إلى ذلك، يحتوي هذا الهاتف الذكي على بطارية قوية تدوم طويلًا توفر ساعات من الترفيه غير المنقطع، مما يجعله شريك السفر المثالي.
                        </p>
                        <p className="text-content-base text-body-small">
                        يحتوي هذا الهاتف من ايفون على ذاكرة وصول عشوائية تبلغ سعتها 4
                         جيجابايت تجعل من تعدد المهام أسرع من أي وقت مضى؛ كما أنها تحمّل ألعاب الرسومية ذات المساحات الكبيرة وتطبيقات تحرير الفيديو بسرعة. يمكنك تخزين المزيد من محتويات الترفيه دون حذف أي من بياناتك أو صورك المخزنة سابقاً، وذلك بفضل سعة الذاكرة المدمجة التي يوفرها هذا الهاتف الذكي بسعة
                          128 جيجابايت. يتميز هاتف ابل ايفون 11 بنظام التشغيل اي او اس 13 الذي يجعل استخدامه فرحة لا مثيل لها. يضيف هذا النظام للتشغيل لمسة من الإثارة بميزات مثل الوضع المظلم
                          على نطاق النظام وتسجيل الدخول باستخدام خيار ابل وواجهة جديدة لتحرير الصور.
                        </p>
                    </div>

                </div>
            </div>
    </div>
  )
}
